tap "adoptopenjdk/openjdk"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazygit"
brew "bash"
brew "ripgrep"
brew "codex"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "lazygit"
brew "neovim"
brew "nvm"
brew "pkgconf"
brew "pyenv"
brew "starship"
brew "tmux"
brew "tree-sitter-cli"
brew "yazi"
brew "yt-dlp"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "bettertouchtool"
cask "blackhole-2ch"
cask "claude-code"
cask "docker-desktop"
cask "firefox@developer-edition"
cask "font-symbols-only-nerd-font"
cask "intellij-idea-ce"
cask "karabiner-elements"
cask "postman"
cask "visual-studio-code"
cask "wezterm"
vscode "astro-build.astro-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.path-intellisense"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "oderwat.indent-rainbow"
vscode "pranaygp.vscode-css-peek"
vscode "robbowen.synthwave-vscode"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "stylelint.vscode-stylelint"
vscode "ue.alphabetical-sorter"
vscode "vscodevim.vim"
